In [1]:
import pandas as pd

create data frame using list

In [14]:
lis = [1,2,3,4,5]
col = ['Number']

In [17]:
dfl = pd.DataFrame(data=lis, columns=col)

In [18]:
dfl

   Number
0       1
1       2
2       3
3       4
4       5

In [46]:
lis = [(1,2,3,4,5), (11,22,33,44,55), (111,222,333,444)]
col = [('ones'), ('twos'), ('threes'), ('fours'), ('fives')]

In [47]:
df = pd.DataFrame(data=lis, columns=[col])

In [35]:
df

  ones twos threes fours fives
0    1    2      3     4   5.0
1   11   22     33    44  55.0
2  111  222    333   444   NaN

In [ ]:
lis = [[1,2,3,4,5], [11,22,33,44,55], [111,222,333,444]]
col = ['ones', 'twos', 'threes', 'fours', 'fives']

by using dictionary

In [41]:
dic = {
    'roll no': [100,200,300, 400],
    'name': ['radha', 'sham', 'bansi', 'murali'],
    
}

In [54]:
df = pd.DataFrame(data=dic, index=[1,2,3,4], columns=['roll no','name', 'roll', 'first'])

In [55]:
df

   roll no    name roll first
1      100   radha  NaN   NaN
2      200    sham  NaN   NaN
3      300   bansi  NaN   NaN
4      400  murali  NaN   NaN

how to fetch a perticula data from row and column

In [57]:
df['name'][3]

'bansi'

create dataframe using multiple series

In [61]:
ser = {
    'a': pd.Series([1,2,3,4,5]),
    'b': pd.Series([10,20,30,40,50])
}

In [62]:
dfser = pd.DataFrame(data=ser)

In [63]:
dfser

   a   b
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50